In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [10]:
data = {"name":["a","b","c","b","c"],"eng":[1,2,3,2,3],"hindi":[1,2,3,2,7]}

In [19]:
df = pd.DataFrame(data)
df

  name  eng  hindi
0    a    1      1
1    b    2      2
2    c    3      3
3    b    2      2
4    c    3      7

In [16]:
# df.duplicated()

In [17]:
# df["duplicate"] = df.duplicated()
# df

In [21]:
df.drop_duplicates(inplace=True)

In [22]:
df

  name  eng  hindi
0    a    1      1
1    b    2      2
2    c    3      3
4    c    3      7

In [23]:
dataset = pd.read_csv(r"D:\ML\WsCubeTech\data\loan\df1_loan.csv")
dataset.head(3)

,Unnamed: 0,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,Total_Income
0,0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y,$5849.0
1,1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N,$6091.0
2,2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y,$3000.0

In [24]:
dataset.shape

(500, 15)

In [25]:
dataset.drop_duplicates(inplace=True)

In [26]:
dataset.shape

(500, 15)